Internal Wave Tank 2024/wave_tank_2D_3phases_k_omega_fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          124;
        startFace       95478;
    }
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          124;
        startFace       95602;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          502;
        startFace       95726;
    }
    atmosphere
    {
        type            patch;
        nFaces          390;
        startFace       96228;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          96048;
        startFace       96618;
    }
)

// ************************************************************************* //
